##

In [2]:
import pandas as pd
df=pd.read_csv("datasets/titanic.csv")

In [4]:
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [7]:
df.drop(["PassengerId","Name","SibSp","Parch","Ticket","Cabin","Embarked"],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [8]:
target=df.Survived
inputs=df.drop('Survived',axis='columns')

In [9]:
dummies=pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [10]:
inputs =pd.concat([inputs,dummies],axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [11]:
inputs.drop('Sex',axis='columns',inplace=True)

In [13]:
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [14]:
inputs.columns[inputs.isna().any()]#NaN value is present in datasets

Index(['Age'], dtype='object')

In [15]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [16]:
inputs.columns[inputs.isna().any()]#NaN value is present in datasets

Index([], dtype='object')

In [27]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(inputs,target,test_size=0.4)

In [28]:
X_train.size

2670

In [29]:
X_test.size

1785

In [30]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [31]:
model.fit(X_train,y_train)

GaussianNB()

In [32]:
model.score(X_test,y_test)

0.7927170868347339

In [33]:
model.predict(X_test[:10])

array([1, 0, 1, 0, 0, 0, 0, 0, 0, 1])

In [34]:
model.predict_proba(X_test[:10])

array([[9.41633810e-02, 9.05836619e-01],
       [9.89742863e-01, 1.02571368e-02],
       [2.29624497e-10, 1.00000000e+00],
       [9.90752282e-01, 9.24771828e-03],
       [9.90928327e-01, 9.07167298e-03],
       [9.74899418e-01, 2.51005820e-02],
       [7.52273946e-01, 2.47726054e-01],
       [9.03402502e-01, 9.65974978e-02],
       [5.62874328e-01, 4.37125672e-01],
       [7.15299840e-02, 9.28470016e-01]])

# SpamEmail or Not SpamEmail

In [37]:
import pandas as pd
df=pd.read_csv("datasets/spam.csv")
df.head()

  Category                                            Message
0      ham  Go until jurong point, crazy.. Available only ...
1      ham                      Ok lar... Joking wif u oni...
2     spam  Free entry in 2 a wkly comp to win FA Cup fina...
3      ham  U dun say so early hor... U c already then say...
4      ham  Nah I don't think he goes to usf, he lives aro...

In [39]:
df.groupby('Category').describe()

         Message                                                            \
           count unique                                                top
Category
ham         4825   4516                             Sorry, I'll call later
spam         747    641  Please call our customer service representativ...


         freq
Category
ham        30
spam        4

In [40]:
df['spam']=df['Category'].apply(lambda x: 1 if x=='spam' else 0)
df.head()

  Category                                            Message  spam
0      ham  Go until jurong point, crazy.. Available only ...     0
1      ham                      Ok lar... Joking wif u oni...     0
2     spam  Free entry in 2 a wkly comp to win FA Cup fina...     1
3      ham  U dun say so early hor... U c already then say...     0
4      ham  Nah I don't think he goes to usf, he lives aro...     0

In [43]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(df.Message,df.spam,test_size=0.3)

In [44]:
from sklearn.feature_extraction.text import CountVectorizer
v=CountVectorizer()
X_train_count=v.fit_transform(X_train.values)
X_train_count.toarray()[:3]

array([[0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0]])

In [45]:
from sklearn.naive_bayes import MultinomialNB
model=MultinomialNB()
model.fit(X_train_count,y_train)

MultinomialNB()

In [47]:
emails=[
    'Hey Srinjay, can we get together to watvh football match tomorrow?',
    'Upto 10% off discount deals on Flipkart Big Billion Day offer and reward. !!!',
    'Reward Incoming MMT plan 10% off on Australia Trip only for you',
    'Hello Hr,Tis is to inform you I have been sick since 3 days and I will not be comming tommorow for next 1 week']
emails_count=v.transform(emails)
model.predict(emails_count)

array([0, 1, 1, 0])

In [48]:
X_test_count=v.transform(X_test)
model.score(X_test_count,y_test)

0.986244019138756

In [51]:
from sklearn.pipeline import Pipeline
clf=Pipeline([
    ('vectorizer',CountVectorizer()),
    ('nb',MultinomialNB())
])

In [52]:
clf.fit(X_train,y_train)

Pipeline(steps=[('vectorizer', CountVectorizer()), ('nb', MultinomialNB())])

In [53]:
clf.score(X_test,y_test)

0.986244019138756

In [55]:
clf.predict(emails)

array([0, 1, 1, 0])